#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_s3_bucket.existing_bucket: Reading...
data.aws_s3_bucket.existing_bucket: Read complete after 1s [id=github-oidc-terraform-aws-tfstates-bucket]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket_policy.existing_bucket_policy will be created
  + resource "aws_s3_bucket_policy" "existing_bucket_policy" {
      + bucket = "github-oidc-terraform-aws-tfstates-bucket"
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::github-oidc-terraform-aws-tfstates-bucket/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_s3_bucket_website_configuration.existing_bucket_website will be created
  + resource "aws_s3_bucket_website_configuration" "existing_bucket_website" {
      + bucket           = "github-oidc-terraform-aws-tfstates-bucket"
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + index_document {
          + suffix = "index.html"
        }
    }

  # aws_s3_object.existing_bucket_files["index.css"] will be created
  + resource "aws_s3_object" "existing_bucket_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "github-oidc-terraform-aws-tfstates-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/css"
      + etag                   = "18b15a012452d5ce43ffd55c7689132b"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "index.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../client//index.css"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.existing_bucket_files["index.html"] will be created
  + resource "aws_s3_object" "existing_bucket_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "github-oidc-terraform-aws-tfstates-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = "fc68073ccd0ceb3768b8b61384db4eae"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "index.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../client//index.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.existing_bucket_files["public/assets/favicon.ico"] will be created
  + resource "aws_s3_object" "existing_bucket_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "github-oidc-terraform-aws-tfstates-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/vnd.microsoft.icon"
      + etag                   = "2f69d20607434d1d95af0ef7bb491b15"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "public/assets/favicon.ico"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../client//public/assets/favicon.ico"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.existing_bucket_files["public/assets/fonts/Creepster-Regular.ttf"] will be created
  + resource "aws_s3_object" "existing_bucket_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "github-oidc-terraform-aws-tfstates-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "2bcd50bbe90a02a290a9c8124800705d"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "public/assets/fonts/Creepster-Regular.ttf"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../client//public/assets/fonts/Creepster-Regular.ttf"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.existing_bucket_files["public/assets/fonts/Creepster-Regular.woff"] will be created
  + resource "aws_s3_object" "existing_bucket_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "github-oidc-terraform-aws-tfstates-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "250dc998195331cb843652286aa7353e"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "public/assets/fonts/Creepster-Regular.woff"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../client//public/assets/fonts/Creepster-Regular.woff"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.existing_bucket_files["public/assets/fonts/OFL.txt"] will be created
  + resource "aws_s3_object" "existing_bucket_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "github-oidc-terraform-aws-tfstates-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "433eead9775371f0aebd6236b33a6373"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "public/assets/fonts/OFL.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../client//public/assets/fonts/OFL.txt"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.existing_bucket_files["public/assets/hanging-logo.png"] will be created
  + resource "aws_s3_object" "existing_bucket_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "github-oidc-terraform-aws-tfstates-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "2378a0436ac85b8994eff54d6446d5f8"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "public/assets/hanging-logo.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../client//public/assets/hanging-logo.png"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.existing_bucket_files["public/assets/profile-default.png"] will be created
  + resource "aws_s3_object" "existing_bucket_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "github-oidc-terraform-aws-tfstates-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "d0d1a7a7076e01740a1856a2f6e96ec8"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "public/assets/profile-default.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../client//public/assets/profile-default.png"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.existing_bucket_files["public/assets/web-bottom-left.png"] will be created
  + resource "aws_s3_object" "existing_bucket_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "github-oidc-terraform-aws-tfstates-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "14a3d136058000384c4d23dda0aa10d4"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "public/assets/web-bottom-left.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../client//public/assets/web-bottom-left.png"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.existing_bucket_files["public/assets/web-bottom-right.png"] will be created
  + resource "aws_s3_object" "existing_bucket_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "github-oidc-terraform-aws-tfstates-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "41b529ab25b751dbb8a6a52c261e7854"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "public/assets/web-bottom-right.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../client//public/assets/web-bottom-right.png"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.existing_bucket_files["public/assets/web-center.png"] will be created
  + resource "aws_s3_object" "existing_bucket_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "github-oidc-terraform-aws-tfstates-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "ed81ad56249a67a6b0b773de9d28e5d6"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "public/assets/web-center.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../client//public/assets/web-center.png"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.existing_bucket_files["public/assets/web-top-left.png"] will be created
  + resource "aws_s3_object" "existing_bucket_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "github-oidc-terraform-aws-tfstates-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "82180f00c34254206aa05154948e5a79"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "public/assets/web-top-left.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../client//public/assets/web-top-left.png"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.existing_bucket_files["public/assets/web-top-right.png"] will be created
  + resource "aws_s3_object" "existing_bucket_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "github-oidc-terraform-aws-tfstates-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/png"
      + etag                   = "fe0f5443ba59ba1d91cf4d96fb3f65c8"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "public/assets/web-top-right.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../client//public/assets/web-top-right.png"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.existing_bucket_files["public/icons/flower.svg"] will be created
  + resource "aws_s3_object" "existing_bucket_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "github-oidc-terraform-aws-tfstates-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/svg+xml"
      + etag                   = "38cffe77ff6efb8dae275d5874d8b2d1"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "public/icons/flower.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../client//public/icons/flower.svg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.existing_bucket_files["public/icons/home.svg"] will be created
  + resource "aws_s3_object" "existing_bucket_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "github-oidc-terraform-aws-tfstates-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/svg+xml"
      + etag                   = "31ffdfbada8bbf38de065e351775cbd4"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "public/icons/home.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../client//public/icons/home.svg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.existing_bucket_files["public/icons/logout-icon.svg"] will be created
  + resource "aws_s3_object" "existing_bucket_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "github-oidc-terraform-aws-tfstates-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/svg+xml"
      + etag                   = "23fb320afc8e3d31f63b02ec9b56bdaf"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "public/icons/logout-icon.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../client//public/icons/logout-icon.svg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.existing_bucket_files["public/icons/newspaper.svg"] will be created
  + resource "aws_s3_object" "existing_bucket_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "github-oidc-terraform-aws-tfstates-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/svg+xml"
      + etag                   = "2b7548a1c740001db89f30b3c15711b5"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "public/icons/newspaper.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../client//public/icons/newspaper.svg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.existing_bucket_files["public/icons/restart.svg"] will be created
  + resource "aws_s3_object" "existing_bucket_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "github-oidc-terraform-aws-tfstates-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/svg+xml"
      + etag                   = "1ee91be42c506169cb76baa792afdcfb"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "public/icons/restart.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../client//public/icons/restart.svg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.existing_bucket_files["public/icons/spider.svg"] will be created
  + resource "aws_s3_object" "existing_bucket_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "github-oidc-terraform-aws-tfstates-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/svg+xml"
      + etag                   = "9ad18425132930cbcc7d5ba64308237d"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "public/icons/spider.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../client//public/icons/spider.svg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.existing_bucket_files["public/icons/splat.svg"] will be created
  + resource "aws_s3_object" "existing_bucket_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "github-oidc-terraform-aws-tfstates-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/svg+xml"
      + etag                   = "0154af19dd147e8e85da14cc80210f83"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "public/icons/splat.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../client//public/icons/splat.svg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.existing_bucket_files["public/icons/star.svg"] will be created
  + resource "aws_s3_object" "existing_bucket_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "github-oidc-terraform-aws-tfstates-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/svg+xml"
      + etag                   = "41eb4f65a1a316c6b4a053df91ee7ebe"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "public/icons/star.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../client//public/icons/star.svg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.existing_bucket_files["public/icons/timer.svg"] will be created
  + resource "aws_s3_object" "existing_bucket_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "github-oidc-terraform-aws-tfstates-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/svg+xml"
      + etag                   = "61c07f79777e7c794c71c7b683b45861"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "public/icons/timer.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../client//public/icons/timer.svg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.existing_bucket_files["script.js"] will be created
  + resource "aws_s3_object" "existing_bucket_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "github-oidc-terraform-aws-tfstates-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "299280f08cbb912d9ab3d2059c3e8e2e"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "script.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../client//script.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.existing_bucket_files["src/api/interface.js"] will be created
  + resource "aws_s3_object" "existing_bucket_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "github-oidc-terraform-aws-tfstates-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "449ffe052a2d6c0554f6b403797c2615"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "src/api/interface.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../client//src/api/interface.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.existing_bucket_files["src/api/oauth.js"] will be created
  + resource "aws_s3_object" "existing_bucket_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "github-oidc-terraform-aws-tfstates-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "b0cf14841aac851603bfc30896bbb25d"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "src/api/oauth.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../client//src/api/oauth.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.existing_bucket_files["src/components/background.js"] will be created
  + resource "aws_s3_object" "existing_bucket_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "github-oidc-terraform-aws-tfstates-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "dc2eec36528662982ce936eb6e61f1b2"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "src/components/background.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../client//src/components/background.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.existing_bucket_files["src/components/button.js"] will be created
  + resource "aws_s3_object" "existing_bucket_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "github-oidc-terraform-aws-tfstates-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "b10fbb3f9865c8363840a1702424696d"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "src/components/button.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../client//src/components/button.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.existing_bucket_files["src/components/flag-count.js"] will be created
  + resource "aws_s3_object" "existing_bucket_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "github-oidc-terraform-aws-tfstates-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "da0b538ba04a0b1c7a30b82350691d53"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "src/components/flag-count.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../client//src/components/flag-count.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.existing_bucket_files["src/components/game-functions.js"] will be created
  + resource "aws_s3_object" "existing_bucket_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "github-oidc-terraform-aws-tfstates-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "7df0ac9ffac2123c2a4adf9a5c3021ff"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "src/components/game-functions.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../client//src/components/game-functions.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.existing_bucket_files["src/components/grid.js"] will be created
  + resource "aws_s3_object" "existing_bucket_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "github-oidc-terraform-aws-tfstates-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "e17e6b3124d58c66172e66ecd8d40c28"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "src/components/grid.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../client//src/components/grid.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.existing_bucket_files["src/components/highscoretable.js"] will be created
  + resource "aws_s3_object" "existing_bucket_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "github-oidc-terraform-aws-tfstates-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "f73a9b137ba101d44118085d0e907720"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "src/components/highscoretable.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../client//src/components/highscoretable.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.existing_bucket_files["src/components/index.js"] will be created
  + resource "aws_s3_object" "existing_bucket_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "github-oidc-terraform-aws-tfstates-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "d41d8cd98f00b204e9800998ecf8427e"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "src/components/index.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../client//src/components/index.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.existing_bucket_files["src/components/navbar.js"] will be created
  + resource "aws_s3_object" "existing_bucket_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "github-oidc-terraform-aws-tfstates-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "40f7921a4538a740e1db65a0e476ed98"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "src/components/navbar.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../client//src/components/navbar.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.existing_bucket_files["src/components/stopwatch.js"] will be created
  + resource "aws_s3_object" "existing_bucket_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "github-oidc-terraform-aws-tfstates-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "22b8046db8ad14f01750239c34d20239"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "src/components/stopwatch.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../client//src/components/stopwatch.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.existing_bucket_files["src/components/tiles.js"] will be created
  + resource "aws_s3_object" "existing_bucket_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "github-oidc-terraform-aws-tfstates-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "fdab5a73d04e985dfaad2035d28edc71"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "src/components/tiles.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../client//src/components/tiles.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.existing_bucket_files["src/components/user-info.js"] will be created
  + resource "aws_s3_object" "existing_bucket_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "github-oidc-terraform-aws-tfstates-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "f66394e9fedafcd21e98c5f824754dd4"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "src/components/user-info.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../client//src/components/user-info.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.existing_bucket_files["src/dummy.js"] will be created
  + resource "aws_s3_object" "existing_bucket_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "github-oidc-terraform-aws-tfstates-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "81a31a49e1cb0d7941ff59fdd7b81e4f"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "src/dummy.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../client//src/dummy.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.existing_bucket_files["src/index.js"] will be created
  + resource "aws_s3_object" "existing_bucket_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "github-oidc-terraform-aws-tfstates-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "d41d8cd98f00b204e9800998ecf8427e"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "src/index.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../client//src/index.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.existing_bucket_files["src/screens/game-page.js"] will be created
  + resource "aws_s3_object" "existing_bucket_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "github-oidc-terraform-aws-tfstates-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "efb2420ef0c4dd930144cc6f10a5f23d"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "src/screens/game-page.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../client//src/screens/game-page.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.existing_bucket_files["src/screens/high-score-page.js"] will be created
  + resource "aws_s3_object" "existing_bucket_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "github-oidc-terraform-aws-tfstates-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "f09c9e2408a2e7d9885864a7e26baf09"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "src/screens/high-score-page.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../client//src/screens/high-score-page.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.existing_bucket_files["src/screens/logIn.js"] will be created
  + resource "aws_s3_object" "existing_bucket_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "github-oidc-terraform-aws-tfstates-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "7487c320e5f96dbcd459686fbdc57b54"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "src/screens/logIn.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../client//src/screens/logIn.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.existing_bucket_files["src/utils/Timer.js"] will be created
  + resource "aws_s3_object" "existing_bucket_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "github-oidc-terraform-aws-tfstates-bucket"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "3208ec43a0cd654f36587dc6d0737f2c"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "src/utils/Timer.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../client//src/utils/Timer.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 44 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @JoeKim-17, Action: `pull_request`*